MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K40/mcu.h
extern volatile __bit                   RC2PPS2             __at(0x77CA);	// @ (0xEF9 * 8 + 2)
#define                                 RC2PPS2_bit         _BIT_ACCESS(RC2PPS,2)
// RC2PPS<RC2PPS3>
extern volatile __bit                   RC2PPS3             __at(0x77CB);	// @ (0xEF9 * 8 + 3)
#define                                 RC2PPS3_bit         _BIT_ACCESS(RC2PPS,3)
// RC2PPS<RC2PPS4>
extern volatile __bit                   RC2PPS4             __at(0x77CC);	// @ (0xEF9 * 8 + 4)
#define                                 RC2PPS4_bit         _BIT_ACCESS(RC2PPS,4)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x7C7B);	// @ (0xF8F * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// RC3PPS<RC3PPS0>
extern volatile __bit                   RC3PPS0             __at(0x77D0);	// @ (0xEFA * 8 + 0)
#define                                 RC3PPS0_bit         _BIT_ACCESS(RC3PPS,0)
// RC3PPS<RC3PPS1>
extern volatile __bit                   RC3PPS1             __at(0x77D1);	// @ (0xEFA * 8 + 1)
#define                                 RC3PPS1_bit         _BIT_ACCESS(RC3PPS,1)
// RC3PPS<RC3PPS2>
extern volatile __bit                   RC3PPS2             __at(0x77D2);	// @ (0xEFA * 8 + 2)
#define                                 RC3PPS2_bit         _BIT_ACCESS(RC3PPS,2)
// RC3PPS<RC3PPS3>
extern volatile __bit                   RC3PPS3             __at(0x77D3);	// @ (0xEFA * 8 + 3)
#define                                 RC3PPS3_bit         _BIT_ACCESS(RC3PPS,3)
// RC3PPS<RC3PPS4>
extern volatile __bit                   RC3PPS4             __at(0x77D4);	// @ (0xEFA * 8 + 4)
#define                                 RC3PPS4_bit         _BIT_ACCESS(RC3PPS,4)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x7C7C);	// @ (0xF8F * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// RC4PPS<RC4PPS0>
extern volatile __bit                   RC4PPS0             __at(0x77D8);	// @ (0xEFB * 8 + 0)
#define                                 RC4PPS0_bit         _BIT_ACCESS(RC4PPS,0)
// RC4PPS<RC4PPS1>
extern volatile __bit                   RC4PPS1             __at(0x77D9);	// @ (0xEFB * 8 + 1)
#define                                 RC4PPS1_bit         _BIT_ACCESS(RC4PPS,1)
// RC4PPS<RC4PPS2>
extern volatile __bit                   RC4PPS2             __at(0x77DA);	// @ (0xEFB * 8 + 2)
#define                                 RC4PPS2_bit         _BIT_ACCESS(RC4PPS,2)
// RC4PPS<RC4PPS3>
extern volatile __bit                   RC4PPS3             __at(0x77DB);	// @ (0xEFB * 8 + 3)
#define                                 RC4PPS3_bit         _BIT_ACCESS(RC4PPS,3)
// RC4PPS<RC4PPS4>
extern volatile __bit                   RC4PPS4             __at(0x77DC);	// @ (0xEFB * 8 + 4)
#define                                 RC4PPS4_bit         _BIT_ACCESS(RC4PPS,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x7C7D);	// @ (0xF8F * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// RC5PPS<RC5PPS0>
extern volatile __bit                   RC5PPS0             __at(0x77E0);	// @ (0xEFC * 8 + 0)
#define                                 RC5PPS0_bit         _BIT_ACCESS(RC5PPS,0)
// RC5PPS<RC5PPS1>
extern volatile __bit                   RC5PPS1             __at(0x77E1);	// @ (0xEFC * 8 + 1)
#define                                 RC5PPS1_bit         _BIT_ACCESS(RC5PPS,1)
// RC5PPS<RC5PPS2>
extern volatile __bit                   RC5PPS2             __at(0x77E2);	// @ (0xEFC * 8 + 2)
#define                                 RC5PPS2_bit         _BIT_ACCESS(RC5PPS,2)
// RC5PPS<RC5PPS3>
extern volatile __bit                   RC5PPS3             __at(0x77E3);	// @ (0xEFC * 8 + 3)
#define                                 RC5PPS3_bit         _BIT_ACCESS(RC5PPS,3)
// RC5PPS<RC5PPS4>
extern volatile __bit                   RC5PPS4             __at(0x77E4);	// @ (0xEFC * 8 + 4)
#define                                 RC5PPS4_bit         _BIT_ACCESS(RC5PPS,4)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x7C7E);	// @ (0xF8F * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// RC6PPS<RC6PPS0>
extern volatile __bit                   RC6PPS0             __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 RC6PPS0_bit         _BIT_ACCESS(RC6PPS,0)
// RC6PPS<RC6PPS1>
extern volatile __bit                   RC6PPS1             __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 RC6PPS1_bit         _BIT_ACCESS(RC6PPS,1)
// RC6PPS<RC6PPS2>
extern volatile __bit                   RC6PPS2             __at(0x77EA);	// @ (0xEFD * 8 + 2)
#define                                 RC6PPS2_bit         _BIT_ACCESS(RC6PPS,2)
// RC6PPS<RC6PPS3>
extern volatile __bit                   RC6PPS3             __at(0x77EB);	// @ (0xEFD * 8 + 3)
#define                                 RC6PPS3_bit         _BIT_ACCESS(RC6PPS,3)
// RC6PPS<RC6PPS4>
extern volatile __bit                   RC6PPS4             __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 RC6PPS4_bit         _BIT_ACCESS(RC6PPS,4)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x7C7F);	// @ (0xF8F * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RC7PPS<RC7PPS0>
extern volatile __bit                   RC7PPS0             __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 RC7PPS0_bit         _BIT_ACCESS(RC7PPS,0)
// RC7PPS<RC7PPS1>
extern volatile __bit                   RC7PPS1             __at(0x77F1);	// @ (0xEFE * 8 + 1)
#define                                 RC7PPS1_bit         _BIT_ACCESS(RC7PPS,1)
// RC7PPS<RC7PPS2>
extern volatile __bit                   RC7PPS2             __at(0x77F2);	// @ (0xEFE * 8 + 2)
#define                                 RC7PPS2_bit         _BIT_ACCESS(RC7PPS,2)
// RC7PPS<RC7PPS3>
extern volatile __bit                   RC7PPS3             __at(0x77F3);	// @ (0xEFE * 8 + 3)
#define                                 RC7PPS3_bit         _BIT_ACCESS(RC7PPS,3)
// RC7PPS<RC7PPS4>
extern volatile __bit                   RC7PPS4             __at(0x77F4);	// @ (0xEFE * 8 + 4)
#define                                 RC7PPS4_bit         _BIT_ACCESS(RC7PPS,4)
// RC1STA<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RC1STA,6)
// RC1STA<RC9>
extern volatile __bit                   RC9                 __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RCD8>
extern volatile __bit                   RCD8                __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RC1STA,0)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// BAUD1CON<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUD1CON,6)
// PIE3<RCIE>
extern volatile __bit                   RCIE                __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE3,5)
// PIR3<RCIF>
extern volatile __bit                   RCIF                __at(0x766D);	// @ (0xECD * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR3,5)
// IPR3<RCIP>
extern volatile __bit                   RCIP                __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR3,5)
// BAUD1CON<RCMT>
extern volatile __bit                   RCMT                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUD1CON,6)
// BAUD1CON<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUD1CON,6)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x7E79);	// @ (0xFCF * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7E49);	// @ (0xFC9 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x7E19);	// @ (0xFC3 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x7C8B);	// @ (0xF91 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// CWG1AS0<REN>
extern volatile __bit                   REN                 __at(0x7A36);	// @ (0xF46 * 8 + 6)
#define                                 REN_bit             _BIT_ACCESS(CWG1AS0,6)
// PCON0<RI>
extern volatile __bit                   RI                  __at(0x7EBA);	// @ (0xFD7 * 8 + 2)
#define                                 RI_bit              _BIT_ACCESS(PCON0,2)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// PCON0<RMCLR>
extern volatile __bit                   RMCLR               __at(0x7EBB);	// @ (0xFD7 * 8 + 3)
#define                                 RMCLR_bit           _BIT_ACCESS(PCON0,3)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x7CB9);	// @ (0xF97 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7CB9);	// @ (0xF97 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// PCON0<RWDT>
extern volatile __bit                   RWDT                __at(0x7EBC);	// @ (0xFD7 * 8 + 4)
#define                                 RWDT_bit            _BIT_ACCESS(PCON0,4)
// RX1PPS<RX1PPS0>
extern volatile __bit                   RX1PPS0             __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 RX1PPS0_bit         _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RX1PPS1>
extern volatile __bit                   RX1PPS1             __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 RX1PPS1_bit         _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RX1PPS2>
extern volatile __bit                   RX1PPS2             __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 RX1PPS2_bit         _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RX1PPS3>
extern volatile __bit                   RX1PPS3             __at(0x75AB);	// @ (0xEB5 * 8 + 3)
#define                                 RX1PPS3_bit         _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RX1PPS4>
extern volatile __bit                   RX1PPS4             __at(0x75AC);	// @ (0xEB5 * 8 + 4)
#define                                 RX1PPS4_bit         _BIT_ACCESS(RX1PPS,4)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// RX1PPS<RXPPS0>
extern volatile __bit                   RXPPS0              __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 RXPPS0_bit          _BIT_ACCESS(RX1PPS,0)
// RX1PPS<RXPPS1>
extern volatile __bit                   RXPPS1              __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 RXPPS1_bit          _BIT_ACCESS(RX1PPS,1)
// RX1PPS<RXPPS2>
extern volatile __bit                   RXPPS2              __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 RXPPS2_bit          _BIT_ACCESS(RX1PPS,2)
// RX1PPS<RXPPS3>
extern volatile __bit                   RXPPS3              __at(0x75AB);	// @ (0xEB5 * 8 + 3)
#define                                 RXPPS3_bit          _BIT_ACCESS(RX1PPS,3)
// RX1PPS<RXPPS4>
extern volatile __bit                   RXPPS4              __at(0x75AC);	// @ (0xEB5 * 8 + 4)
#define                                 RXPPS4_bit          _BIT_ACCESS(RX1PPS,4)
// SSP1STAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_NOT_W1>
extern volatile __bit                   R_NOT_W1            __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_NOT_W1_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<S2>
extern volatile __bit                   S2                  __at(0x7CAB);	// @ (0xF95 * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP1STAT,3)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x7CC2);	// @ (0xF98 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x7707);	// @ (0xEE0 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SCANCON0<SCANBUSY>
extern volatile __bit                   SCANBUSY            __at(0x7A7D);	// @ (0xF4F * 8 + 5)
#define                                 SCANBUSY_bit        _BIT_ACCESS(SCANCON0,5)
// SCANCON0<SCANEN>
extern volatile __bit                   SCANEN              __at(0x7A7F);	// @ (0xF4F * 8 + 7)
#define                                 SCANEN_bit          _BIT_ACCESS(SCANCON0,7)
// SCANCON0<SCANGO>
extern volatile __bit                   SCANGO              __at(0x7A7E);	// @ (0xF4F * 8 + 6)
#define                                 SCANGO_bit          _BIT_ACCESS(SCANCON0,6)
// SCANHADRL<SCANHADR0>
extern volatile __bit                   SCANHADR0           __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 SCANHADR0_bit       _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<SCANHADR1>
extern volatile __bit                   SCANHADR1           __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 SCANHADR1_bit       _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<SCANHADR10>
extern volatile __bit                   SCANHADR10          __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 SCANHADR10_bit      _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<SCANHADR11>
extern volatile __bit                   SCANHADR11          __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 SCANHADR11_bit      _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<SCANHADR12>
extern volatile __bit                   SCANHADR12          __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 SCANHADR12_bit      _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<SCANHADR13>
extern volatile __bit                   SCANHADR13          __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 SCANHADR13_bit      _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<SCANHADR14>
extern volatile __bit                   SCANHADR14          __at(0x7A6E);	// @ (0xF4D * 8 + 6)
#define                                 SCANHADR14_bit      _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<SCANHADR15>
extern volatile __bit                   SCANHADR15          __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 SCANHADR15_bit      _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<SCANHADR16>
extern volatile __bit                   SCANHADR16          __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 SCANHADR16_bit      _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<SCANHADR17>
extern volatile __bit                   SCANHADR17          __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 SCANHADR17_bit      _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<SCANHADR18>
extern volatile __bit                   SCANHADR18          __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 SCANHADR18_bit      _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<SCANHADR19>
extern volatile __bit                   SCANHADR19          __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 SCANHADR19_bit      _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<SCANHADR2>
extern volatile __bit                   SCANHADR2           __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 SCANHADR2_bit       _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<SCANHADR20>
extern volatile __bit                   SCANHADR20          __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 SCANHADR20_bit      _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<SCANHADR21>
extern volatile __bit                   SCANHADR21          __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 SCANHADR21_bit      _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<SCANHADR3>
extern volatile __bit                   SCANHADR3           __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 SCANHADR3_bit       _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<SCANHADR4>
extern volatile __bit                   SCANHADR4           __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 SCANHADR4_bit       _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<SCANHADR5>
extern volatile __bit                   SCANHADR5           __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 SCANHADR5_bit       _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<SCANHADR6>
extern volatile __bit                   SCANHADR6           __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 SCANHADR6_bit       _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<SCANHADR7>
extern volatile __bit                   SCANHADR7           __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 SCANHADR7_bit       _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<SCANHADR8>
extern volatile __bit                   SCANHADR8           __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 SCANHADR8_bit       _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<SCANHADR9>
extern volatile __bit                   SCANHADR9           __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 SCANHADR9_bit       _BIT_ACCESS(SCANHADRH,1)
// PIE7<SCANIE>
extern volatile __bit                   SCANIE              __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE7,7)
// PIR7<SCANIF>
extern volatile __bit                   SCANIF              __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR7,7)
// SCANCON0<SCANINTM>
extern volatile __bit                   SCANINTM            __at(0x7A7B);	// @ (0xF4F * 8 + 3)
#define                                 SCANINTM_bit        _BIT_ACCESS(SCANCON0,3)
// SCANCON0<SCANINVALID>
extern volatile __bit                   SCANINVALID         __at(0x7A7C);	// @ (0xF4F * 8 + 4)
#define                                 SCANINVALID_bit     _BIT_ACCESS(SCANCON0,4)
// IPR7<SCANIP>
extern volatile __bit                   SCANIP              __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 SCANIP_bit          _BIT_ACCESS(IPR7,7)
// SCANLADRL<SCANLADR0>
extern volatile __bit                   SCANLADR0           __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 SCANLADR0_bit       _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<SCANLADR1>
extern volatile __bit                   SCANLADR1           __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 SCANLADR1_bit       _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<SCANLADR10>
extern volatile __bit                   SCANLADR10          __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 SCANLADR10_bit      _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<SCANLADR11>
extern volatile __bit                   SCANLADR11          __at(0x7A53);	// @ (0xF4A * 8 + 3)
